---
kind: type
id: T:Autodesk.Revit.DB.LayoutRule
source: html/c185b000-4194-6186-5964-5da2f05ace86.htm
---
# Autodesk.Revit.DB.LayoutRule

The LayoutRule object is a base object for all type of layout rules for
Beam System within the Autodesk Revit API.

## Syntax (C#)
```csharp
public abstract class LayoutRule : APIObject
```

## Remarks
This class just used as the base class of those concrete LayoutRule classes.